//=====================================================================
// 文件名称: SI7021.h
// 芯片类型: STM32F103T8U6                                          
// 开发软件: Keil, Windows 7                                                                 
// 程序功能: 温湿度传感器驱动程序
// 编写人员: 幕阜山人                                                                       
// 联系方式: QQ:254262132  Email:flex@163.com  
//==============版本信息===============================================
// 日    期  -----  版    本  -----  描    述
// 2013.07.25   　   V1.0     　　    初始版本 
//======================================================================
#ifndef __SI7021_H
#define __SI7021_H
 #include <stm32f10x.h>

#define	WRITE_CMD		         0x80
#define	READ_CDM		         0x81
#define	SALVE_ADDR		       0x80

#define	HUMI_HOLD_MASTER	   0xE5
#define	TEMP_HOLD_MASTER	   0xE3
		
#define	HUMI_NOHOLD_MASTER	 0xF5
#define	TEMP_NOHOLD_MASTER   0xF3
//===========================  函数声明   =============================
u8 SI7021_Read_Data(u8 Model,u16 *temp);
u8 SI7021_Read(u16 *temp,u16 *humi);
#endif

//======================================================================
//                                   0ooo
//                          ooo0     (   ) 
//                          (   )     ) /
//                           \ (     (_/
//                            \_) 
//======================================================================


